# Import Join 1 and Join 2 sheet from the excel file and create a new dataframe that will have all ID with name and age columns. Which join will you use? There is a duplicate value? Is it crating any problem for your joining?

In [1]:
# Code
import pandas as pd

In [2]:
join1 = pd.read_excel('data_join.xlsx',sheet_name='Join 1')
join2 = pd.read_excel('data_join.xlsx',sheet_name='Join 2')
join3= pd.merge(join1,join2)
join3.drop_duplicates(inplace=True)
join3

   ID    Name  Age
0   1   Robat   34
1   2   Seggy   55
2   3  Donald   66
3   4   Pavel   78

The duplicates value didn't create any problem in joining

# Print the median and mean age of all ID from your newly created dataframe

In [44]:
# Code

join3['Age'].median()

60.5

# Print the age difference between Donald and Pavel

In [85]:
# Code
dAge = join3.loc[(join3.Name=='Donald')]['Age']
dAge = dAge.iloc[0]

dAge

66

In [92]:
pAge = join3.loc[(join3.Name=='Pavel')]['Age']
pAge = pAge.iloc[0]
pAge

78

In [97]:
#Differnce between them
diff = pAge - dAge
print('Age Diffrence between pavel & DOnald is',diff)

Age Diffrence between pavel & DOnald is 12

In [67]:
(join3.loc[(join3.Name=='Pavel')]['Age'])-(join3.loc[(join3.Name=='Donald')]['Age'])

2   NaN
3   NaN
Name: Age, dtype: float64

# Import Jan sales and Feb sales. Merge the two dataframe to create a full database of jan and feb sales

In [19]:
# code
jansales = pd.read_excel('data_join.xlsx',sheet_name='Jan sales')
febsales = pd.read_excel('data_join.xlsx',sheet_name='Feb sales')

In [20]:
jansales

   Cus ID Month  Sales
0      10   Jan     10
1      20   Jan     20
2      30   Jan     30
3      40   Jan     50

In [21]:
febsales

   Cus ID Month  Sales
0      50   Feb     10
1      60   Feb     50
2      70   Feb     40
3      80   Feb     90

In [22]:
#joining two database

In [33]:
newsales = pd.concat([jansales, febsales], axis=0)
newsales

   Cus ID Month  Sales
0      10   Jan     10
1      20   Jan     20
2      30   Jan     30
3      40   Jan     50
0      50   Feb     10
1      60   Feb     50
2      70   Feb     40
3      80   Feb     90

In [29]:
newsales

   Cus ID Month  Sales
0      10   Jan     10
1      20   Jan     20
2      30   Jan     30
3      40   Jan     50
0      50   Feb     10
1      60   Feb     50
2      70   Feb     40
3      80   Feb     90

# Export the full database of sales data to excel (xlsx) file

In [31]:
# code
newsales.to_excel('newsales.xlsx',sheet_name='Sheet1')

# Find the sales difference in percentage between January and February

In [40]:
# code

In [36]:
def percentage_change(col1,col2):
    return ((col2 - col1) / col1) * 100

In [42]:
jansales['sales diff'] = percentage_change(jansales['Sales'],febsales['Sales']) 
jansales['sales diff'] # sales diff for individual

0      0.000000
1    150.000000
2     33.333333
3     80.000000
Name: sales diff, dtype: float64

In [43]:
jansales['sales diff'].mean() #overall sales diff

65.83333333333333